# Pandas 연습문제

In [12]:
import numpy as np
import pandas as pd

### 1. population_age_2020.csv 파일을 읽어들여 2차원 리스트에 저장한 다음 실행 결과와 같이 출력하는 프로그램을 작성하시오.

In [3]:
%%writefile sample/population_age_2020.csv
지역,총인구수,0~9세,10~19세,20~29세,30~39세,40~49세,50~59세,60~69세,70~79세,80~89세,90~99세,100세 이상
서울,9736962,658355,813563,1455903,1505729,1563968,1539385,1200518,688818,263939,40404,6380
부산,3410925,241624,281120,434692,431911,518321,580966,511174,285602,109312,14396,1807
대구,2432883,186623,234528,321487,303397,391997,428622,311274,171217,74227,8817,694
인천,2954955,239941,281097,405835,417708,490716,515758,344843,172269,74306,11574,908
광주,1456121,125396,162728,207554,191432,244903,234048,155056,91020,38050,5529,405
대전,1473125,120476,151861,212143,199106,242381,243526,170291,88289,39190,5523,339
울산,1145710,103399,115623,147745,158271,190698,211255,136520,57438,21610,2991,160
세종,343788,47454,40574,36273,61442,65714,42907,27813,13609,6863,1084,55
경기도,13265377,1178548,1347854,1769080,1917785,2299179,2205106,1422638,742296,330231,48650,4010
강원도,1539521,108694,141975,179813,169694,227950,269666,226444,135668,68321,10493,803
충청북도,1598599,128290,153119,198910,198768,243982,273857,209926,119037,63513,8656,541
충청남도,2120995,179808,206578,243748,276553,329789,340568,264305,167339,97941,13481,885
전라북도,1815112,135297,180675,212339,195971,274471,303074,244901,165445,89352,12770,817
전라남도,1861894,137868,172888,202760,193083,265366,317226,259385,191719,105793,14984,822
경상북도,2658956,198214,233506,291097,303472,390995,464427,389498,238482,130716,17589,960
경상남도,3358828,282751,331566,384750,418383,543911,585186,435315,240111,119977,16139,739
제주도,670876,62086,71539,81968,84145,113076,111221,75172,44621,22963,3819,266

Overwriting sample/population_age_2020.csv

In [4]:
x = pd.read_csv('sample/population_age_2020.csv')
x

,지역,총인구수,0~9세,10~19세,20~29세,30~39세,40~49세,50~59세,60~69세,70~79세,80~89세,90~99세,100세 이상
0,서울,9736962,658355,813563,1455903,1505729,1563968,1539385,1200518,688818,263939,40404,6380
1,부산,3410925,241624,281120,434692,431911,518321,580966,511174,285602,109312,14396,1807
2,대구,2432883,186623,234528,321487,303397,391997,428622,311274,171217,74227,8817,694
3,인천,2954955,239941,281097,405835,417708,490716,515758,344843,172269,74306,11574,908
4,광주,1456121,125396,162728,207554,191432,244903,234048,155056,91020,38050,5529,405
5,대전,1473125,120476,151861,212143,199106,242381,243526,170291,88289,39190,5523,339
6,울산,1145710,103399,115623,147745,158271,190698,211255,136520,57438,21610,2991,160
7,세종,343788,47454,40574,36273,61442,65714,42907,27813,13609,6863,1084,55
8,경기도,13265377,1178548,1347854,1769080,1917785,2299179,2205106,1422638,742296,330231,48650,4010
9,강원도,1539521,108694,141975,179813,169694,227950,269666,226444,135668,68321,10493,803
10,충청북도,1598599,128290,153119,198910,198768,243982,273857,209926,119037,63513,8656,541
11,충청남도,2120995,179808,206578,243748,276553,329789,340568,264305,167339,97941,13481,885
12,전라북도,1815112,135297,180675,212339,195971,274471,303074,244901,165445,89352,12770,817
13,전라남도,1861894,137868,172888,202760,193083,265366,317226,259385,191719,105793,14984,822
14,경상북도,2658956,198214,233506,291097,303472,390995,464427,389498,238482,130716,17589,960
15,경상남도,3358828,282751,331566,384750,418383,543911,585186,435315,240111,119977,16139,739
16,제주도,670876,62086,71539,81968,84145,113076,111221,75172,44621,22963,3819,266

### 2. 1번의 2차원 리스트 네이터에 대해 열과 행을 바꾸는 프로그램을 작성하시오

In [5]:
y = x.T.values
print(y)

[['서울' '부산' '대구' '인천' '광주' '대전' '울산' '세종' '경기도' '강원도' '충청북도' '충청남도'
  '전라북도' '전라남도' '경상북도' '경상남도' '제주도']
 [9736962 3410925 2432883 2954955 1456121 1473125 1145710 343788 13265377
  1539521 1598599 2120995 1815112 1861894 2658956 3358828 670876]
 [658355 241624 186623 239941 125396 120476 103399 47454 1178548 108694
  128290 179808 135297 137868 198214 282751 62086]
 [813563 281120 234528 281097 162728 151861 115623 40574 1347854 141975
  153119 206578 180675 172888 233506 331566 71539]
 [1455903 434692 321487 405835 207554 212143 147745 36273 1769080 179813
  198910 243748 212339 202760 291097 384750 81968]
 [1505729 431911 303397 417708 191432 199106 158271 61442 1917785 169694
  198768 276553 195971 193083 303472 418383 84145]
 [1563968 518321 391997 490716 244903 242381 190698 65714 2299179 227950
  243982 329789 274471 265366 390995 543911 113076]
 [1539385 580966 428622 515758 234048 243526 211255 42907 2205106 269666
  273857 340568 303074 317226 464427 585186 111221]
 [1200518 511174 311274 344843 155056 170291 136520 27813 1422638 226444
  209926 264305 244901 259385 389498 435315 75172]
 [688818 285602 171217 172269 91020 88289 57438 13609 742296 135668
  119037 167339 165445 191719 238482 240111 44621]
 [263939 109312 74227 74306 38050 39190 21610 6863 330231 68321 63513
  97941 89352 105793 130716 119977 22963]
 [40404 14396 8817 11574 5529 5523 2991 1084 48650 10493 8656 13481 12770
  14984 17589 16139 3819]
 [6380 1807 694 908 405 339 160 55 4010 803 541 885 817 822 960 739 266]]

### 3. 2번의 2차원 리스트 데이터를 딕셔너리 데이터 형으로 변환하는 프로그램을 작성하시오.

In [6]:
key = x.columns
value = []
for i in range(len(y)):
    k = list(y[i])
    value.append(k)

dict_list = dict(zip(key, value))
print(dict_list)

{'지역': ['서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기도', '강원도', '충청북도', '충청남도', '전라북도', '전라남도', '경상북도', '경상남도', '제주도'], '총인구수': [9736962, 3410925, 2432883, 2954955, 1456121, 1473125, 1145710, 343788, 13265377, 1539521, 1598599, 2120995, 1815112, 1861894, 2658956, 3358828, 670876], '0~9세': [658355, 241624, 186623, 239941, 125396, 120476, 103399, 47454, 1178548, 108694, 128290, 179808, 135297, 137868, 198214, 282751, 62086], '10~19세': [813563, 281120, 234528, 281097, 162728, 151861, 115623, 40574, 1347854, 141975, 153119, 206578, 180675, 172888, 233506, 331566, 71539], '20~29세': [1455903, 434692, 321487, 405835, 207554, 212143, 147745, 36273, 1769080, 179813, 198910, 243748, 212339, 202760, 291097, 384750, 81968], '30~39세': [1505729, 431911, 303397, 417708, 191432, 199106, 158271, 61442, 1917785, 169694, 198768, 276553, 195971, 193083, 303472, 418383, 84145], '40~49세': [1563968, 518321, 391997, 490716, 244903, 242381, 190698, 65714, 2299179, 227950, 243982, 329789, 274471, 265366, 390995, 543911, 113076], '50~59세': [1539385, 580966, 428622, 515758, 234048, 243526, 211255, 42907, 2205106, 269666, 273857, 340568, 303074, 317226, 464427, 585186, 111221], '60~69세': [1200518, 511174, 311274, 344843, 155056, 170291, 136520, 27813, 1422638, 226444, 209926, 264305, 244901, 259385, 389498, 435315, 75172], '70~79세': [688818, 285602, 171217, 172269, 91020, 88289, 57438, 13609, 742296, 135668, 119037, 167339, 165445, 191719, 238482, 240111, 44621], '80~89세': [263939, 109312, 74227, 74306, 38050, 39190, 21610, 6863, 330231, 68321, 63513, 97941, 89352, 105793, 130716, 119977, 22963], '90~99세': [40404, 14396, 8817, 11574, 5529, 5523, 2991, 1084, 48650, 10493, 8656, 13481, 12770, 14984, 17589, 16139, 3819], '100세 이상': [6380, 1807, 694, 908, 405, 339, 160, 55, 4010, 803, 541, 885, 817, 822, 960, 739, 266]}

In [7]:
print(x.to_dict('list'))

{'지역': ['서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기도', '강원도', '충청북도', '충청남도', '전라북도', '전라남도', '경상북도', '경상남도', '제주도'], '총인구수': [9736962, 3410925, 2432883, 2954955, 1456121, 1473125, 1145710, 343788, 13265377, 1539521, 1598599, 2120995, 1815112, 1861894, 2658956, 3358828, 670876], '0~9세': [658355, 241624, 186623, 239941, 125396, 120476, 103399, 47454, 1178548, 108694, 128290, 179808, 135297, 137868, 198214, 282751, 62086], '10~19세': [813563, 281120, 234528, 281097, 162728, 151861, 115623, 40574, 1347854, 141975, 153119, 206578, 180675, 172888, 233506, 331566, 71539], '20~29세': [1455903, 434692, 321487, 405835, 207554, 212143, 147745, 36273, 1769080, 179813, 198910, 243748, 212339, 202760, 291097, 384750, 81968], '30~39세': [1505729, 431911, 303397, 417708, 191432, 199106, 158271, 61442, 1917785, 169694, 198768, 276553, 195971, 193083, 303472, 418383, 84145], '40~49세': [1563968, 518321, 391997, 490716, 244903, 242381, 190698, 65714, 2299179, 227950, 243982, 329789, 274471, 265366, 390995, 543911, 113076], '50~59세': [1539385, 580966, 428622, 515758, 234048, 243526, 211255, 42907, 2205106, 269666, 273857, 340568, 303074, 317226, 464427, 585186, 111221], '60~69세': [1200518, 511174, 311274, 344843, 155056, 170291, 136520, 27813, 1422638, 226444, 209926, 264305, 244901, 259385, 389498, 435315, 75172], '70~79세': [688818, 285602, 171217, 172269, 91020, 88289, 57438, 13609, 742296, 135668, 119037, 167339, 165445, 191719, 238482, 240111, 44621], '80~89세': [263939, 109312, 74227, 74306, 38050, 39190, 21610, 6863, 330231, 68321, 63513, 97941, 89352, 105793, 130716, 119977, 22963], '90~99세': [40404, 14396, 8817, 11574, 5529, 5523, 2991, 1084, 48650, 10493, 8656, 13481, 12770, 14984, 17589, 16139, 3819], '100세 이상': [6380, 1807, 694, 908, 405, 339, 160, 55, 4010, 803, 541, 885, 817, 822, 960, 739, 266]}

### 4. 3번의 딕셔너리 데이터를 DataFrame에 저장한 다음 실행 결과와 같이 출력하는 프로그램을 작성하시오.

In [8]:
z = pd.DataFrame(dict_list)

print(z[[z.columns[0], z.columns[8], z.columns[9], z.columns[10], z.columns[11], z.columns[12]]])

      지역   60~69세  70~79세  80~89세  90~99세  100세 이상
0     서울  1200518  688818  263939   40404     6380
1     부산   511174  285602  109312   14396     1807
2     대구   311274  171217   74227    8817      694
3     인천   344843  172269   74306   11574      908
4     광주   155056   91020   38050    5529      405
5     대전   170291   88289   39190    5523      339
6     울산   136520   57438   21610    2991      160
7     세종    27813   13609    6863    1084       55
8    경기도  1422638  742296  330231   48650     4010
9    강원도   226444  135668   68321   10493      803
10  충청북도   209926  119037   63513    8656      541
11  충청남도   264305  167339   97941   13481      885
12  전라북도   244901  165445   89352   12770      817
13  전라남도   259385  191719  105793   14984      822
14  경상북도   389498  238482  130716   17589      960
15  경상남도   435315  240111  119977   16139      739
16   제주도    75172   44621   22963    3819      266

### 5. 4번의 DataFrame에 저장된 데이터를 '100세 이상'열을 기준으로 하여 내림차순으로 정렬한 다음 실행 결과와 같이 출력하는 프로그램을 작성하시오.

In [9]:
t = z.sort_values(by="100세 이상",ascending=False)[[z.columns[0], z.columns[12]]]
print(t)

      지역  100세 이상
0     서울     6380
8    경기도     4010
1     부산     1807
14  경상북도      960
3     인천      908
11  충청남도      885
13  전라남도      822
12  전라북도      817
9    강원도      803
15  경상남도      739
2     대구      694
10  충청북도      541
4     광주      405
5     대전      339
16   제주도      266
6     울산      160
7     세종       55

# 연습문제 풀이(데이터 사이언스)

# 연습문제 4.4.4

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

20살이 넘으면 성별을 그대로 사용한다.

20살 미만이면 성별에 관계없이 “child”라고 한다.

In [8]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

# 연습 문제 4.4.5
타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [10]:
titanic['age'] = titanic['age'].fillna(round(titanic.age.mean(), 2))
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

# 연습 문제 4.4.6
타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

성별을 나타내는 문자열 male 또는 female로 시작한다.

성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.

예를 들어 27살 남성은 male27 값이 된다.

In [16]:
titanic["category2"] = titanic.sex.astype(str) + titanic.age.astype(str)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,male22.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,female38.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,female26.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,female35.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,male35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,male27.0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,female19.0
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,female29.7
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,male26.0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0

# 연습 문제 4.4.7
타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [13]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanics = pd.cut(titanic['age'], bins, labels=labels)

print(titanics)

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [14]:
print(titanics.value_counts()/titanics.count())

청년      0.464082
중년      0.274800
미성년자    0.188141
장년      0.067275
노년      0.005701
Name: age, dtype: float64

# 연습 문제 4.4.8
타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

20살 미만이면 성별에 관계없이 “미성년자”라고 한다.

20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [17]:
titanic2 = pd.DataFrame(titanic['age'].astype(int), columns=["age"])
titanic2["age_cut"] = pd.cut(titanic2.age, bins, labels=labels)
titanic2

     age age_cut
0     22      청년
1     38      중년
2     26      청년
3     35      중년
4     35      중년
..   ...     ...
886   27      청년
887   19    미성년자
888   29      청년
889   26      청년
890   32      중년

[891 rows x 2 columns]

In [18]:
titanic["sex"] = titanic.apply(lambda r: "여성" if r.sex == "female" else "남성", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27.0
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19.0
888,0,3,여성,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female29.7
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26.0
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0

In [19]:
titanic['category3'] = titanic2.age_cut.astype(str) + titanic.sex
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,category3
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27.0,청년남성
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19.0,미성년자여성
888,0,3,여성,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female29.7,청년여성
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26.0,청년남성
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0,중년남성

In [20]:
titanic["category3"] = titanic.apply(lambda r: "미성년자" if r.category3 == "미성년자여성" else r.category3, axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,category3
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27.0,청년남성
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19.0,미성년자
888,0,3,여성,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female29.7,청년여성
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26.0,청년남성
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0,중년남성

In [21]:
titanic["category3"] = titanic.apply(lambda r: "미성년자" if r.category3 == "미성년자남성" else r.category3, axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,category3
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27.0,청년남성
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19.0,미성년자
888,0,3,여성,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female29.7,청년여성
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26.0,청년남성
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0,중년남성